require "pp"
#计时开始
t1 = Time.now
p t1


input = "D:/ruby/SMS-Spam-Classifier/data/data_test.txt"
output = "D:/ruby/SMS-Spam-Classifier/data/data_result_predict.txt"

spamdic = "xx,xxx,xxxx,xxxxxxxxxxx,活动,您好,优惠,欢迎,xxxxxxx,全场,地址,顾客,xxxxx,电话,xxxxxxxx,祝您,赠送,致电,报名,光 临,特价,推出,免费,三八,女人,本店,回馈,礼品,专柜,原价,新年好,热线,尊敬,感谢您,咨询,联系,会员,进店,元宵节,享受, 客户,三八妇女节,三八节,亲爱,新老,欢迎您,优惠活动,快乐,即可,特惠,xxxxxx,专业,来电,我们,各位,红包,你好,时间,选购,xxxxxxxxxxxxxxxxxxx,现金,美丽,公司,老客户,开始,新款,朋友,前来,好消息,亲们,买一送一,家长,三月,购买,春装,当天, 充值,装修,新春,期待,奶粉,话费,装饰,服务,抢购,可以,产品,期间,详询,妇女节,护理,预约,需要,办理,体验,销售,养生,元 宵,半价,咨询电话,辅导,促销,感谢,感恩,精美,品牌,价值,春季,有限,套盒,有限公司,多多,平米,先得,惊喜,家装,支持,一次,消费,联系电话,积分,新年快乐,员工,答谢,现场,限时,获得,新品,业主,短信,化妆品,节日快乐,为您服务,项目,大家,参加, 开课,任意,谢谢,抵押,仅限,还有,美容,主营,招聘,手机,提供,名额有限,业务,先到,宽带,日到,低至,xG,老师,大型,提前,开 年,超市,套餐,日至,广场,学习,现在,价格,开班,恭祝,空调,一年,美女,英语,商场,预存,新年,联系人,购物,二楼,一口价,详 情,教育,全体,国际,户型,限量,利息,万起,可抵,满额,文胸,火热,举办,超值,店长,最低,开业,贷款,银行,酒店,团购,魅力,为了,孩子,顾问,最高,置业,折扣,本月,彩妆,机会,购机,小区,家具,全年,数量,样板房,防晒,作业,喜迎,移动,我司,春季班,微 信,xxxxxxxxx,VIP,折后,豪礼,日起,学车,xxxxxxxxxx,元起,立减,一套,现房,建材,经理,一天,啤酒,伊布,厂家,内衣店,羊年,准现房,迎接,招生,一份,周六,面膜,玫瑰,平安,凭此,上市,女性,放款,姐姐,来袭,回复,庆祝,培训,大礼包,独家,灯谜,即将, 手续,瓷砖,购物满,进行,正式,额外,大吉,百货,步行街,周年,竭诚,信用贷款,汽车,到来之际,正月,驾校,礼物,护肤品,正月十五,农行,到货,代金券,韩束,哥弟,样板间,xS,幻时,巨献,大放送,尊享,单品,车贷,下午,上海,来临,以上,双倍,一瓶,品质,错 过,即日起,多少,专属,美甲,小时,第二件,领取,截止,课程,专卖店,了解,服饰,丽人,老板,五折,折起,闹元宵,内衣,介绍,冬装,全套,举行,秋冬,学员,学费,非常,家居,另有,不要,一个,八折,美容院,房源,实木,中心,商品,欲购从速,冲刺班,理财,平方, 营业厅,系列,订购,开盘,以下,支行,秒杀,女装,生活,获赠,各种,师傅,同学,春天,快递,万人空巷,洋房,从速,商务,存款,抽奖,漂亮,除外,佳节,圆圆,认购,福利,力度,新学期,限购,指定,针对,赶快,电信,诚邀,我店,店庆,com,万抵,买满,包过,买赠,老 带,xxM,套组,来店,号楼,直降,健康,预定,新生,赠礼,惠顾,金蛋,信用,一台,划算,容错过,八号,一楼,鼓掌,恭候,客户经理,三重,制作,系列产品,本人,之际,周末,初莲花,配件,关爱,开学,送礼,底薪,特权,苹果,现已,到来,试听,大道,资金,大礼,教学, 汕头市,礼包,为止,生产,诚招,名额,南路,打扰,订单,总价,详情请,百分百,双飞,设计师,所有,施工,打造,精装,免费送,对面,女神,特别,生意兴隆,质保,成功,参与,格力,品鉴,企业,教练,申请,家人,绝对,赠品,成绩,正在,发售,有礼,相赠,拨打,新春快乐,惊爆价,小凯,机不可失,方案,科技,四楼,每天,承接,武汉,设备,理疗,升级,面部,快速,新车,石材,幸运,黄金,精彩,部分, 阳光,正价,酬宾,退订,报税,等你拿,交叉口,卫浴,老生,全面,变频,两天,特色,厚爱,签约,双节,光纤,书法,绍兴,挖掘机,推荐,祝愿,设计,合作,现价,塑料模具,有意者,本学期,疗程,杭州,路南,贴心,节日,奖励,工作,让利,节日期间,贵宾,春节,开设,出售,女士,愉快,欢迎光临,一名,香水,洽谈,到场,上班,空瓶,上岗证,同步,房产,全新,快捷,相送,心动,工长,李经理,购价,开工,千元,一张,任性,年化,美白,美的,再享,店内,欧诗漫,大屏,潘涯,拜个,xD,幻时佳,主材,爱克,優惠,我校,美业,圣象,TD,本厂,全包,义乳,GIADA,大放价,广进,挖机,易贷,中包,柜机,仅售,春款,飞鹤,全系,欲报,活動,好礼,安莉芳,马承,开课时间,童画,眼部,广州,高端,二手车,折上,美体,割草机,爱钱,机会难得,全款,担保,凡是,单价,大力支持,财源滚滚,华强,邮政,只有,皇家,位于,三天,商业,学生,家电,优惠券,东鹏,电器,西路,幼儿园,门店,天天,邀请函,家庭幸福,诚意,男女,天使,中餐,单张,高考,质量保证,绝版,简单,首付,一号,疯狂,一线,额度,精品,尽快,地点,菜谱,一线品牌,九折,龙蛇,热销,号码,定制,全国,信用卡,真诚,诚信,中路,整装,开门红,珠宝,地铁,每吨,北京,上门服务,多重,步步高,酒水,包间,保养,个人,时光,户口,同时,三房, 珍珠,工资,专注,钥匙,如果,友谊,方便,费用,最大,垂询,收益率,任选,上午,之前,热线电话,莅临,大厦,或者,母婴,开锁,写真,兴业银行,月薪,佳人,我行,只要,豪华,理财产品,一站式,完美,加入,今天,货品,陶瓷,值此,时尚,名师,小包,准备,资金周转,财源,花灯,护肤,职称,亲朋好友,渤海,型号,提成,过期,模特,小魏,一起,圆柱,年级,花园,一件,专场,亲戚朋友,大酒店,恭喜,邀请,转发,喜讯,提高,信任,重磅,围棋,拜年,培训班,柠檬,上海大众,台州,省钱,从事,最后,无线,火爆,一盒,作文,先生,统货,烧烤店,展位号,返利,教学点,音波,韩国,工行,底价,本田,性价比,资格,开发,品味,联盟,兴趣,三楼,综合,打车,最低价,定期,联通,如下,过来,华润,这里,安装,单位,名城,第一件,随时,买单,市场,投保,电梯,分部,本科,数学,张倩,英语学校,包商,件 套,丽都,新会员,超声,北路,信誉,信息,一个月,装满,妈妈,预售,营业,温馨,盛宴,预订,柜台,以旧换新,今年,相当于,李伟,吉祥,购车,一斤,记得,请谅解,店址,育婴师,仅此一次,闭馆,屈臣氏,按揭,网址,休闲,各类,事业单位,哥哥,任何,本市,搬迁,厂 房,简便,携手,房子,陆续,现有,南北,失不再来,小西,营销策划,新货,一店,吊顶,生活馆,格瓦拉,德惠,来福士,全程,出租,清 洗,金额,江北,第一家,用品,新城,体检,回家,兑换,大量,场地,抓紧,自己,支局,陶然,带薪,洁具,十号,艺校,地铁口,资生堂, 峡山,征集,带给,女王,一支,苏宁,会计,保障,预交,户名,辅导班,胸部,高兴,底盘,托管,借款,低价,招募,SPA,选沃,配镜,提高班,温碧泉,陈海能,全金,好礼赠,京润,xxxxxxxxxxxxxx,美药妆,号馆,爱步,年春款,捷越,即享,节来,珀莱雅,特琳娜,仙奴,Txxx,Song,ochirly,华美达,金坤,测温仪,吴娇,随学,热售,押车,贝因美,玛丝,欧派,梵洁,OLAY,QQ,鲁巷,祝賀,号院,鲁广,试学, 元得,神墨,河月子,铂玺,融金,VlP,幻活,即止,博蜜思,名妆,xP,元及,抵用,百喜特,荷婷曲,平皱,张硕,看房,网购,研色,创艺,现车,日止,接店,衣車部,优蕙,鼎佳,日游,..,长富,转自,打款,总包,BB,直减,Bx,叶浩,软装,迎新春,施尔,欧时力,QQxxxxxxxxxx,推堂,光临惠顾,喝徒,买二送,接车,Cx,伊芙丽,Vx,莼美,元现,www,新老朋友,TEL,底商,每满,梦舒雅,金装,DHC,急售,Ax,即赠,三迪,认筹,三象,恒大,裤业,远博,九木堂,精裝,油卡"
normaldic = "xx,手机,2015,xxxx,电脑,南京,百度,10,xxx,飞机,微软,真相,机器人,电梯,花千骨,今天,医院,浙江,设计,江苏,30,苏州,可 以,15,一个,医生,声音,中国,旅游,自己,地铁,质疑,20,腾讯,视频,法院,现在,看到,就是,卫视,我们,装修,没有,什么,城管, 无锡,12,微博,50,时候,亚马逊,防晒,知道,华为,汽车,投资,公司,违法,分享,还是,扬州,设计师,你们,政府,感觉,进行,招聘,警察,小时,真的,建筑,发布,一起,100,11,工作,喜欢,不要,发现,上海,NBA,13,这个,已经,徐州,浙江省,开始,集团,检察院,因为,昨天,然后,活动,18,使用,怎么,时间,一下,每天,大家,服务,14,23,加油,演唱会,不是,咨询,盗窃,安全,晚上,觉得,信息, 认证,朋友,Google,阿里,还有,开展,一直,红包,分钟,居然,细胞,这么,QQ,16,25,28,常州,一样,北京,举报,小偷,强奸,互联网,肌肤,生活,不能,40,有限公司,可能,应该,欧美,法官,为什么,下载,公交,问题,通过,金融,南通,免费,人民法院,江苏省,很多,坐飞机,那么,面膜,只有,中心,一天,提供,他们,项目,化妆水,卫星,专业,17,29,500,下午,正式,产品,蜂蜜,不会,软件,移动,社区,发生,照片,今年,希望,不到,如果,这样,国家,以及,明天,美国,台风,出来,案件,电话,法律,结果,气象台,地铁站,各种, 升级,需要,新闻,适合,一定,老师,早上,之后,那个,皮肤,最近,美白,24,26,22,31,1000,21,70,相关,来自,城市,枸杞,一款,东西,国际,组织,别人,死刑,小区,第一,平台,关于,信用卡,公安局,正在,启动,参加,这种,是不是,谷歌,之前,现场,涉嫌,模式, 一次,最好,犯罪,贪官,所有,游戏,90,有个,我要,以后,疾病,裁判,依法,体验,宝宝,公安,基金,看看,告诉,打开,最新,为了,创新,反腐,一些,粉刺,同学,邀请,只是,护士,事故,世界,企业,男子,搜索,人员,科技,司法,其实,上班,市场,建设,登录,地方,举行,媒体,竟然,Twitter,19,200,2000,360,不想,不公,起来,阿里巴巴,真是,日本,火箭,爸爸,酒店,公开,原因,融资,哈哈哈,派出所,物业,成为,成功,对于,刚刚,所以,支持,女孩,违法行为,工作人员,昆山,诉讼,第一次,工程,高速,防晒霜,或者,保险,培 训,来到,专家,天气,今晚,教师,作为,智能,整治,空间,最美,领导,品牌,苹果,有人,感谢,坦克,3000,Amazon,影讯,A股,27,号 线,学校,爱心,教育,每次,孩子,滨海,盐城,全国,终于,广告,研究生,方向,一家,遇到,了解,万元,但是,用户,登陆,两个,维生 素,坐电梯,图片,杭州,街道,系统,一张,特别,推出,然而,全部,实践,电影,更新,行为,机场,智能手机,简直,理财,回来,召开, 一种,系列,妈妈,只要,文件,消息,可是,人民检察院,夏季,商业,人生,玩电脑,检查,部门,选择,信号,里面,江阴,APP,P2P,微信,传看,灿鸿,300,MH370,Windows10,60,80,获得,出租车,民警,要求,目前,爆料,网络,睡觉,推荐,营业厅,突然,股票,南京市,公告,重要,同时,考试,深圳,城管局,附近,宿迁,看着,全球,天天,管理,有些,啊啊啊,暑期,不过,才能,直接,效果,解决,广州,好 像,方式,小伙伴,尼玛,发展,一切,一名,广场,计划,时代,团队,社会,医疗,淮安,万达,能够,杀人偿命,淮安市,女子,最后,浏览器,投资者,完美,腐败,哈哈哈哈,不了,任何,基本,不同,官网,win10,2014,4000,云网盘,云里,安卓,amp,00,Win10,如何,只能,交警,一位,收到,粉丝,澳洲,坚持,梦想,回家,音乐,行业,消防,拥有,这些,情况,晚点,宣布,平板,保护,专项,小米,全市,个人,大学,超级,版本,以上,一行,新款,中药,节目,联合,带来,韩国,镇江,关系,以前,开庭审理,简单,好多,会计,几天,人民,我市, 曝光,非常,之一,功能,合作,垃圾,影城,我家,子宫,朋友圈,警方,信用,上午,租赁,业务,所谓,完全,主题,驾驶,进入,整个,其 中,警车,工作室,无法,网页,详情,应用,决定,事件,拍摄,网站,利用,公里,找到,相信,还要,对冲,基因,学院,出现,淘宝,完成,包括,位于,多少,展览,办公室,短信,努力,准备,报名,不用,肯定,租房,google,PC,iPhone,1200,吐槽,xxxxx,4G,xxxxxxxxxxx,速度,刷屏,事情,交通,地图,主要,得到,多次,欢迎,全省,感受,愿意,夏天,经过,精华,达到,抢劫,比赛,惠普,这是,摄影,帮助,西安,处理,左右,打电话,不错,资源,这款,查处,展示,四个,身体,故事,屏幕,一年,网友,保证,揭秘,人才,滴滴,大赛,交易,就 要,客户端,组合,公益,审判,加入,招聘会,考虑,密码,健康,介绍,依然,幼儿园,中午,一路,功效,虽然,记得,那些,其他,自拍, 成立,导致,财富,老人,比较,可爱,最大,必须,想要,举办,官员,利益,火车,技术,一句,事实,路上,新区,学生,行动,提示,度过,必备,本来,赔偿,听到,昨晚,快乐,合肥,充电,电商,辖区,资讯,成都,越来越,后悔,开心,存在,记者,价值,保养,好吃,尝试,三 个,配音,股份,国家队,办理,申请,打不开,一个月,以为,起诉,女人,绝对,亿元,去年,根本,开发,常熟,乘客,微商,Android,150,via,08,做空,IBM,45,gt,37,36,nba,CBD,好好,员工,高端,颜色,记录,预警,自动,文化,看见,清洁,海门,再也,健身,别墅,我 妈,原来,曾经,实习生,未来,山东,坐地铁,仪式,连衣裙,案例,今日,患者,机构,无锡市,年度,国内,链接,滥用,会议,销售,能力,地址,礼物,凌晨,联盟,推进,真正,哪里,的话,扶梯,家里,继续,支付,一点,司机,发布会,女士,网上,现金,执法,被告人,巨头,空调,大道,吴江,销量,智商,而已,公交车,客户,会员,安装,拿出,小伙,泰州,违规,数据,报警,女性,电视剧,眼睛,执行,基础, 流量,保障,下来,上半年,女儿,土匪,歌王,蜀黍,手环,全新,黄色,赌博,调查,本人,基地,上线,两天,唯一,嫌疑人,银行,诺基亚,宜兴,普通,违法犯罪,高温,马云,青少年,不够,容易,搭配,勾结,打造,氧气,课程,南城,拿到,大队,方案,因涉嫌,补贴,流泪, 恢复,诈骗,自行车,到底,潜规则,旅行,拒绝,内幕,有效,超过,设置,提前,一条,判刑,快速,受贿,电视,青春,顾问,罚款,水平, 不行,一带,多名,重点,变成,创业,老板,建议,小学,旗舰,接受,周年,手机号,下面,同事,不好,以下,录取,内部,制度,明明,全 面,受理,安检员,双开,督查,七点,研发,评论,武汉,证券,世纪,实现,公布,支付宝,客服,正常,消费者,研究,球队,通知,过程, 城区,想起,底线,地点,不再,离开,做到,开发区,内存,日至,影响,99,同款,日起,bigbang,3D,VIP,com,Windows,天猫,swisse,2016,日晚,SUV,众筹,O2O,5000,祛痘,包邮,32,35,amazon,54,app,88,直邮,预计,报销,回应,面对,路段,苏州市,招商,病毒,非 法,一遍,有期徒刑,大战,简洁,期货,大众,平米,实在,政策,评审,近日,结束,房产,味道,拆除,规定,一套,特价,白子,经理,正 确,解除,老公,出发,至少,处理器,这里,天津,减肥,为何,反馈,设备,万人,男孩,不管,高铁"

file_input = File.open(input)
file_output = File.open(output,"w")

max_matches = 2000 #print out the max line
matches = 0
str = ""

file_input.each_line do |line|
  
  if matches >= max_matches
     break     
  end 
 
  sline = line.split(/\t/)
  
#  num = (sline[1].length > 65)?1:0

   if sline[1].length > 66
     num = 1
   elsif sline[1] =~ /xxxxxx+/
     num = 1
   elsif sline[1] =~ /www/
     num = 1
   elsif sline[1] =~ /【.*】/
     num = 1
   elsif sline[1] =~ /！/
     num = 1
   elsif sline[1] =~ /您好/
     num = 1
   elsif sline[1] =~ /你好/
    num = 1
   elsif sline[1] =~ /欢迎您/
     num = 1
   elsif sline[1] =~ /优惠/    
     num = 1
   elsif sline[1] =~ /全场/
    num = 1
   elsif sline[1] =~ /↓/
     num = 1
   else
     num = 0
   end
   
   
#  p sline
=begin   
  spam_wc = 0
  
  sline.each do |word|
   word = word.strip! 
   if  spamdic.include?(word)
     spam_wc += 1
   end   
  end
  
  pp spam_wc
  
  if spam_wc > 13 
    num = 1
  elsif line =~ /xxxxxx+/
    num = 1
  else   
    num = 0
  end
=end
  
#pp   spamdic.include?("活动")
  
  str = str+"#{sline[0]},#{num}\n" 
       
  matches += 1
  
end

file_output.write(str)

file_output.close
file_input.close

#计时结束
t2 = Time.now
p t2

puts "总共耗时：#{t2 - t1}s"